fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <attributes>
    <name>Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ОтпускаСотрудников</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/ВКМ_ГрафикОтпусков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Для Каждого СтрокаОтпуска Из ОтпускаСотрудников Цикл
		
		Если СтрокаОтпуска.ДатаНачала = '00010101' Или СтрокаОтпуска.ДатаОкончания = '00010101' Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаОтпуска.ДатаОкончания < СтрокаОтпуска.ДатаНачала Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ОтпускаСотрудников[0].ДатаОкончания";
			Сообщение.Текст = "Дата окончания отпуска не может быть раньше даты начала.";
			Сообщение.Сообщить();
			Продолжить;
		КонецЕсли;
		
		Если Год(СтрокаОтпуска.ДатаНачала) <> Год Или Год(СтрокаОтпуска.ДатаОкончания) <> Год Тогда
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "ОтпускаСотрудников[0].ДатаНачала";
			Сообщение.Текст = СтрШаблон(
				"Период отпуска сотрудника %1 должен находиться в пределах года %2.",
				СтрокаОтпуска.Сотрудник, Год);
			Сообщение.Сообщить();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
